//-----------------------------------------------------------------
// 程序描述:
//      外部中断驱动程序头文件
// 作    者: 凌智电子
// 开始日期: 2020-11-11
// 完成日期: 2020-11-11
// 修改日期: 
// 当前版本: V1.0
// 历史版本:
//  - V1.0: (2020-11-11)外部中断初始化，中断时执行相应的事情
// 调试工具: 凌智STM32H750核心板、LZE_ST_LINK2
// 说    明: 
//
//-----------------------------------------------------------------
#ifndef _EXTI_H
#define _EXTI_H
#include "system.h"

typedef void (*EXTI_IRQHandler_Callback)(void *user_env);

#define EXTI_KEY1 1
#define EXTI_KEY2 (1<<1)
#define EXTI_KEY3 (1<<2)
#define EXTI_KEY4 (1<<3)

//-----------------------------------------------------------------
// 外部函数声明
//-----------------------------------------------------------------
void EXTI_Init(uint32_t keyMask);
void EXTI_Register(uint32_t keyMask, EXTI_IRQHandler_Callback callback, void *user_env);
//-----------------------------------------------------------------

#endif
//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
